# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. 
# Поскольку разобраться в его кричалках не настолько просто, насколько легко он их 
# придумывает, Вам стоит написать программу. Винни-Пух считает, что ритм есть,
# если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. 
# Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются 
# дефисами. Фразы отделяются друг от друга пробелами. Стихотворение  Винни-Пух вбивает 
# в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в 
# порядке и “Пам парам”, если с ритмом все не в порядке
# 
# Ввод:
# пара-ра-рам рам-пам-папам па-ра-па-да
#
# Вывод:
# Парам пам-пам


def count_vowels(words):
    vowels = 'юияэоаыеуйёЮИЯЭОАЫЕУЙЁ'
    vowels_words = [[letter for letter in word if letter in vowels] for word in words]
    vowels_count_words = [len(vowels) for vowels in vowels_words]
    return all(x == vowels_count_words[0] for x in vowels_count_words)


poem = input()
poem_words = poem.split(' ')
if count_vowels(poem_words):
    print('Парам пам-пам')
else:
    print('Пам парам')